
// ==UserScript==
// @name          mt highlight words
// @namespace     http://www.dserg.com
// @description	  website moderator tool: highlight abusive words on page (russian, utf8)
// @include       http://hosting101.ru/*
// ==/UserScript==

(function() {

// + case insensitive

  var words = ['безобразн', 'ужас', 'отврат', 'жутк', 'дерьм', 'хуй', 'нихуя', 'нехуя', 'говн', 'говен', 'гавн', 'тупая', 'тупой', 'тупые', 'хам', 'пизд', 'капец', 'копец', 'здец', 'пипец', 'ппц', 'пидор', 'пида', 'пидр', 'мудак', 'дебил', 'гемор', ' лох', 'мошен', 'развод', ' кину', ' кида', 'заср', 'хер', ' фиг', 'школ', 'малолет', 'уеб', 'уёб', 'ебан', 'ебал', 'ёба', 'долбо', 'отсто', 'урод', 'сдох', 'бабл', ' нах ', 'лаж', 'лузер', 'убог', 'жульн', ' воры', ' вору', 'украл', 'гони', ' уг ', ' уг.', 'туфт', 'параш', 'парш', 'криворук', 'сосу', 'соса', 'дрян', 'шара', 'черт', 'чёрт', 'бред', 'хрен', 'угроз', 'угрож', 'хохл', 'пиндос', 'чурк', 'дохл', 'кошма', 'жуть', 'жлоб', 'сволоч', 'в аду', 'бегите', 'связываться', 'плева', 'плюю'];
  var c = document.body;
  var str = c.innerHTML;
  
  for (var i = 0; i < words.length; i++) {
    str = str.replace(words[i], ' &bull; ' + words[i], 'gi');
  }
  c.innerHTML = str; 
  
})();
